
"{General}"			= "General";
"{TIFF}"			= "TIFF";
"{GIF}"				= "GIF";
"{JFIF}"			= "JFIF";
"{Exif}"			= "Exif";
"{PNG}"				= "PNG";
"{IPTC}"			= "IPTC";
"{GPS}"				= "GPS";
"{Raw}"				= "Raw";
"{CIFF}"			= "Canon";
"{MakerCanon}"		= "Canon";
"{MakerNikon}"		= "Nikon";
"{8BIM}"			= "Photoshop";
"{DNG}"				= "DNG";
"{MakerMinolta}"	= "Minolta";
"{MakerFuji}"       = "Fuji";
"{MakerOlympus}"	= "Olympus";
"{MakerPentax}"     = "Pentax";

kIKLocalizedImageBitPerChannel = "%d Bit/Channel";
kIKLocalizedImageBitsPerChannel = "%d Bits/Channel";

kImageViewRotationOverlay = "%.1f°\n∆ %.1f";

"TIFF.Compression.1" = "uncompressed";
"TIFF.Compression.5" = "LZW";
"TIFF.Compression.6" = "JPEG compression (thumbnails only)";
"TIFF.Compression.8" = "ZIP";
"TIFF.Compression.32773" = "PackBits";
"TIFF.Compression.other" = "reserved";

"TIFF.PhotometricInterpretation.2" = "RGB";
"TIFF.PhotometricInterpretation.5" = "YCbCr";
"TIFF.PhotometricInterpretation.other" = "reserved";

"General.Orientation.1" = "1 (Normal)";
"General.Orientation.2" = "2 (Flipped horizontally)";
"General.Orientation.3" = "3 (Rotated 180°)";
"General.Orientation.4" = "4 (Flipped vertically)";
"General.Orientation.5" = "5 (Rotated 90° CCW and flipped vertically)";
"General.Orientation.6" = "6 (Rotated 90° CCW)";
"General.Orientation.7" = "7 (Rotated 90° CW and flipped vertically)";
"General.Orientation.8" = "8 (Rotated 90° CW)";
"General.Orientation.other" = "reserved";

"TIFF.Orientation.1" = "1 (Normal)";
"TIFF.Orientation.2" = "2 (Flipped horizontally)";
"TIFF.Orientation.3" = "3 (Rotated 180°)";
"TIFF.Orientation.4" = "4 (Flipped vertically)";
"TIFF.Orientation.5" = "5 (Rotated 90° CCW and flipped vertically)";
"TIFF.Orientation.6" = "6 (Rotated 90° CCW)";
"TIFF.Orientation.7" = "7 (Rotated 90° CW and flipped vertically)";
"TIFF.Orientation.8" = "8 (Rotated 90° CW)";
"TIFF.Orientation.other" = "reserved";

"TIFF.ResolutionUnit.2" = "inches";
"TIFF.ResolutionUnit.3" = "centimeters";
"TIFF.ResolutionUnit.other" = "reserved";

"TIFF._YCbCrPositioning.1" = "centered";
"TIFF._YCbCrPositioning.2" = "co-sited";
"TIFF._YCbCrPositioning.other" = "reserved";

"Exif.ColorSpace.1" = "sRGB";
"Exif.ColorSpace.-1" = "Uncalibrated";
"Exif.ColorSpace.other" = "reserved";

"Exif.ExposureProgram.0" = "Not defined";
"Exif.ExposureProgram.1" = "Manual";
"Exif.ExposureProgram.2" = "Normal program";
"Exif.ExposureProgram.3" = "Aperture priority";
"Exif.ExposureProgram.4" = "Shutter priority";
"Exif.ExposureProgram.5" = "Creative program";
"Exif.ExposureProgram.6" = "Action program";
"Exif.ExposureProgram.7" = "Portrait mode";
"Exif.ExposureProgram.8" = "Landscape mode";
"Exif.ExposureProgram.other" = "reserved";

"Exif.MeteringMode.0" = "unknown";
"Exif.MeteringMode.1" = "Average";
"Exif.MeteringMode.2" = "CenterWeightedAverage";
"Exif.MeteringMode.3" = "Spot";
"Exif.MeteringMode.4" = "MultiSpot";
"Exif.MeteringMode.5" = "Pattern";
"Exif.MeteringMode.6" = "Partial";
"Exif.MeteringMode.255" = "other";
"Exif.MeteringMode.other" = "reserved";

"Exif.FocalPlaneResolutionUnit.2" = "inches";
"Exif.FocalPlaneResolutionUnit.3" = "centimeters";

"Exif.LightSource.0" = "unknown";
"Exif.LightSource.1" = "Daylight";
"Exif.LightSource.2" = "Fluorescent";
"Exif.LightSource.3" = "Tungston (incandescent light)";
"Exif.LightSource.4" = "Flash";
"Exif.LightSource.9" = "Fine weather";
"Exif.LightSource.10" = "Cloudy weather";
"Exif.LightSource.11" = "Shade";
"Exif.LightSource.12" = "Daylight fluorescent (D5700 - 7100K)";
"Exif.LightSource.13" = "Day white fluorescent (N4600 - 5400K)";
"Exif.LightSource.14" = "Cool white fluorescent (W3900 - 4500K)";
"Exif.LightSource.15" = "White fluorescent (WW3200 - 3700K)";
"Exif.LightSource.17" = "Standard light A";
"Exif.LightSource.18" = "Standard light B";
"Exif.LightSource.19" = "Standard light C";
"Exif.LightSource.20" = "D55";
"Exif.LightSource.21" = "D65";
"Exif.LightSource.22" = "D75";
"Exif.LightSource.23" = "D50";
"Exif.LightSource.24" = "ISO studio tungsten";
"Exif.LightSource.255" = "other light source";
"Exif.LightSource.other" = "reserved";

"Exif.Flash.0" = "Flash did not fire";
"Exif.Flash.1" = "Flash fired";
"Exif.Flash.5" = "Strobe return light not detected";
"Exif.Flash.7" = "Strobe return light detected";
"Exif.Flash.9" = "Flash fired, compulsory flash mode";
"Exif.Flash.13" = "Flash fired, compulsory flash mode, return light not detected";
"Exif.Flash.15" = "Flash fired, compulsory flash mode, return light detected";
"Exif.Flash.16" = "Flash did not fire, compulsory flash mode";
"Exif.Flash.24" = "Flash did not fire, auto mode";
"Exif.Flash.25" = "Flash fired, auto mode";
"Exif.Flash.29" = "Flash fired, auto mode, return light not detected";
"Exif.Flash.31" = "Flash fired, auto mode, return light detected";
"Exif.Flash.32" = "No flash function";
"Exif.Flash.65" = "Flash fired, red-eye reduction mode";
"Exif.Flash.69" = "Flash fired, red-eye reduction mode, return light not detected";
"Exif.Flash.71" = "Flash fired, red-eye reduction mode, return light detected";
"Exif.Flash.73" = "Flash fired, compulsory flash mode, red-eye reduction mode";
"Exif.Flash.77" = "Flash fired, compulsory flash mode, red-eye reduction mode, return light not detected";
"Exif.Flash.79" = "Flash fired, compulsory flash mode, red-eye reduction mode, return light detected";
"Exif.Flash.89" = "Flash fired, auto mode, red-eye reduction mode";
"Exif.Flash.93" = "Flash fired, auto mode, return light not detected, red-eye reduction mode";
"Exif.Flash.95" = "Flash fired, auto mode, return light detected, red-eye reduction mode";
"Exif.Flash.other" = "reserved";

"Exif.SensingMethod.1" = "Not defined";
"Exif.SensingMethod.2" = "One-chip color area sensor";
"Exif.SensingMethod.3" = "Two-chip color area sensor";
"Exif.SensingMethod.4" = "Three-chip color area sensor";
"Exif.SensingMethod.5" = "Color sequential area sensor";
"Exif.SensingMethod.7" = "Trilinear sensor";
"Exif.SensingMethod.8" = "Color sequential linear sensor";
"Exif.SensingMethod.other" = "reserved";

"Exif.FileSource.3" = "DSC";
"Exif.FileSource.other" = "reserved";

"Exif.SceneType.1" = "A directly photographed image";
"Exif.SceneType.other" = "reserved";

"Exif.CustomRendered.0" = "Normal process";
"Exif.CustomRendered.1" = "Custom process";
"Exif.CustomRendered.other" = "reserved";

"Exif.ExposureMode.0" = "Auto exposure";
"Exif.ExposureMode.1" = "Manual exposure";
"Exif.ExposureMode.2" = "Auto bracket";
"Exif.ExposureMode.other" = "reserved";

"Exif.OwnerName.unknown" = "unknown";

"Exif.WhiteBalance.0" = "Auto white balance";
"Exif.WhiteBalance.1" = "Manual white balance";
"Exif.WhiteBalance.other" = "reserved";

"Exif.SceneCaptureType.0" = "Standard";
"Exif.SceneCaptureType.1" = "Landscape";
"Exif.SceneCaptureType.2" = "Portrait";
"Exif.SceneCaptureType.3" = "Night scene";
"Exif.SceneCaptureType.other" = "reserved";

"Exif.GainControl.0" = "None";
"Exif.GainControl.1" = "Low gain up";
"Exif.GainControl.2" = "High gain up";
"Exif.GainControl.3" = "Low gain down";
"Exif.GainControl.4" = "High gain down";
"Exif.GainControl.other" = "reserved";

"Exif.Contrast.0" = "Normal";
"Exif.Contrast.1" = "Soft";
"Exif.Contrast.2" = "Hard";
"Exif.Contrast.other" = "reserved";

"Exif.Saturation.0" = "Normal";
"Exif.Saturation.1" = "Low saturation";
"Exif.Saturation.2" = "High saturation";
"Exif.Saturation.other" = "reserved";

"Exif.Sharpness.0" = "Normal";
"Exif.Sharpness.1" = "Soft";
"Exif.Sharpness.2" = "Hard";
"Exif.Sharpness.other" = "reserved";

"Exif.SubjectDistRange.0" = "unknown";
"Exif.SubjectDistRange.1" = "Macro";
"Exif.SubjectDistRange.2" = "Close view";
"Exif.SubjectDistRange.3" = "Distant view";
"Exif.SubjectDistRange.other" = "reserved";

"GPS.AltitudeRef.0" = "above sea level";
"GPS.AltitudeRef.1" = "below sea level";
"GPS.AltitudeRef.other" = "reserved";

"GPS.formatter.degrees" = "%@° ";
"GPS.formatter.minutes" = "%@\' ";
"GPS.formatter.seconds" = "%@\" ";

"GPS.AltitudeUnit.0" = "m";
"GPS.AltitudeUnit.1" = "ft";

"GPS.LatitudeRef.N" = "N";
"GPS.LatitudeRef.S" = "S";

"GPS.LongitudeRef.W" = "W";
"GPS.LongitudeRef.E" = "E";

"GPS.SpeedRef.K" = "Kilometers per hour";
"GPS.SpeedRef.M" = "Miles per hour";
"GPS.SpeedRef.N" = "Knots";
"GPS.SpeedRef.other" = "reserved";

"GPS.TrackRef.T" = "True direction";
"GPS.TrackRef.M" = "Magnetic direction";
"GPS.TrackRef.other" = "reserved";

"GPS.ImgDirectionRef.T" = "True direction";
"GPS.ImgDirectionRef.M" = "Magnetic direction";
"GPS.ImgDirectionRef.other" = "reserved";

"GPS.DestBearingRef.T" = "True direction";
"GPS.DestBearingRef.M" = "Magnetic direction";
"GPS.DestBearingRef.other" = "reserved";

"GPS.DestDistanceRef.K" = "Kilometers";
"GPS.DestDistanceRef.M" = "Miles";
"GPS.DestDistanceRef.N" = "Knots";
"GPS.DestDistanceRef.other" = "reserved";

"GPS.Differential.0" = "Measurement without differential correction";
"GPS.Differential.1" = "Differential correction applied";
"GPS.Differential.other" = "reserved";

